product-scenarios/backend-service/ballerinaService/resources/xml/request/1_3_2_2_1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><getUserDetails xmlns="http://services.samples"><request><userName>Shadow:):)</userName></request></getUserDetails></soapenv:Body></soapenv:Envelope>
